#+TITLE: kbol - Knowledge Base from Technical Books
#+AUTHOR: Jason Walsh
#+EMAIL: j@wal.sh
#+DATE: 2024-11-15

*** ML/AI Foundations
#+begin_src bash :tangle data/answers/foundations_mlp.sh :mkdirp t
# Check ML Engineering fundamentals
time poetry run kbol query "What does the book 'Machine Learning Engineering with Python' cover about MLOps and production deployment?" | tee data/answers/foundations-mlp.md | head 
#+end_src

#+RESULTS:
#+begin_example

Found relevant content in:
• MLOps_Engineering_at_Scale
• machinelearningengineeringwithpython_secondedition
• tinymlcookbook

Generating response...
╭─────────────────────────────────── Answer ───────────────────────────────────╮
│ The book "Machine Learning Engineering with Python" by Andrew P. McMahon     │
│ covers various aspects of ML Ops (MLOps) as well as how to deploy machine    │
#+end_example

#+begin_src bash :tangle data/answers/foundations_fe.sh :mkdirp t
# Verify feature engineering coverage
poetry run kbol query "What practical examples are shown in 'Python Feature Engineering Cookbook'?" | tee data/answers/foundations-fe.md | head 
#+end_src

#+RESULTS:
#+begin_example

Found relevant content in:
• 15mathconceptseverydatascientistshouldknow
• Deep_Learning_with_Python
• Practices_of_the_Python_Pro
• machinelearningengineeringwithpython_secondedition

Generating response...
╭─────────────────────────────────── Answer ───────────────────────────────────╮
│ The "Python Feature Engineering Cookbook" provides a range of real-world,    │
#+end_example

